results/results/raw/intrazone/calico-intrazone-apachebench_10M_800_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.6 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.6
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      400
Time taken for tests:   70.466 seconds
Complete requests:      500000
Failed requests:        0
Total transferred:      427000000 bytes
HTML transferred:       306000000 bytes
Requests per second:    7095.65 [#/sec] (mean)
Time per request:       56.373 [ms] (mean)
Time per request:       0.141 [ms] (mean, across all concurrent requests)
Transfer rate:          5917.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   21   6.7     21    1055
Processing:     5   35  10.1     34     192
Waiting:        0   28  10.5     27     186
Total:         11   56   9.9     55    1083

Percentage of the requests served within a certain time (ms)
  50%     55
  66%     58
  75%     59
  80%     61
  90%     67
  95%     72
  98%     80
  99%     85
 100%   1083 (longest request)