results/results/raw/intrazone/calico_vxlan-intrazone-apachebench_1M_200_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.2 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.2
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      200
Time taken for tests:   199.691 seconds
Complete requests:      1000000
Failed requests:        68
   (Connect: 0, Receive: 0, Length: 52, Exceptions: 16)
Total transferred:      854000000 bytes
HTML transferred:       612000000 bytes
Requests per second:    5007.74 [#/sec] (mean)
Time per request:       39.938 [ms] (mean)
Time per request:       0.200 [ms] (mean, across all concurrent requests)
Transfer rate:          4176.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   10   7.2     10    1047
Processing:     3   19 208.0     17   60063
Waiting:        2   14   5.3     14     118
Total:          7   29 208.1     27   60063

Percentage of the requests served within a certain time (ms)
  50%     27
  66%     29
  75%     30
  80%     31
  90%     33
  95%     35
  98%     39
  99%     43
 100%  60063 (longest request)