results/results/raw/intrazone/flannel-intrazone-apachebench_200K_500_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.5 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.5
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      500
Time taken for tests:   20.919 seconds
Complete requests:      200000
Failed requests:        0
Total transferred:      170800000 bytes
HTML transferred:       122400000 bytes
Requests per second:    9560.87 [#/sec] (mean)
Time per request:       52.296 [ms] (mean)
Time per request:       0.105 [ms] (mean, across all concurrent requests)
Transfer rate:          7973.62 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   43 237.1      5    7294
Processing:     0    6   6.0      5     218
Waiting:        0    5   4.9      4     218
Total:          0   50 236.4     13    7295

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     19
  75%     20
  80%     21
  90%     24
  95%     27
  98%   1020
  99%   1023
 100%   7295 (longest request)