results/results/raw/intrazone/flannel-intrazone-apachebench_400K_200_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.6 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.6
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      250
Time taken for tests:   6.108 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      85400000 bytes
HTML transferred:       61200000 bytes
Requests per second:    16372.07 [#/sec] (mean)
Time per request:       15.270 [ms] (mean)
Time per request:       0.061 [ms] (mean, across all concurrent requests)
Transfer rate:          13654.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   5.8      7    1036
Processing:     0    9   2.7      9      32
Waiting:        0    7   2.4      6      24
Total:          1   15   6.5     16    1045

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     17
  75%     18
  80%     18
  90%     18
  95%     19
  98%     21
  99%     22
 100%   1045 (longest request)